configuration/src/InformationRegisters/EmailAccountSettings/EmailAccountSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EmailAccountSettings</name>
  <resources>
    <name>AddSignatureForNewMessages</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>NewMessageSignatureFormat</name>
    <type>
      <types>EnumRef.EmailEditingMethods</types>
    </type>
  </resources>
  <resources>
    <name>SignatureForNewMessagesPlainText</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>SignatureForNewMessagesFormattedDocument</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AddSignatureOnReplyForward</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ReplyForwardSignatureFormat</name>
    <type>
      <types>EnumRef.EmailEditingMethods</types>
    </type>
  </resources>
  <resources>
    <name>ReplyForwardSignaturePlainText</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ReplyForwardSignatureFormattedDocument</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>DeletePersonalAccount</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>EmployeeResponsibleForProcessingEmails</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>EmployeeResponsibleForFoldersMaintenance</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>DeleteEmailsAfterSend</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PutEmailInBaseEmailFolder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>NotUseInDefaultEmailClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IncludeUsernameInPresentation</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>MailHandlingInOtherMailClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>DateOfLastUse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>EmailAccount</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/EmailEditingMethods/EmailEditingMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EmailEditingMethods</name>
  <enumValues>
    <name>NormalText</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Constants/SendEmailsInHTMLFormat/ValueManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Value Then
		Return;
	EndIf;
	
	BeginTransaction();
	
	Try
		
		Block = New DataLock;
		Block.Add("InformationRegister.EmailAccountSettings");
		Block.Lock();
		
		// Switching signatures of all email accounts to plain text.
		AccountsSettings = InformationRegisters.EmailAccountSettings.CreateRecordSet();
		AccountsSettings.Read();
		For Each Setting In AccountsSettings Do
			Setting.NewMessageSignatureFormat = Enums.EmailEditingMethods.NormalText;
			Setting.ReplyForwardSignatureFormat = Enums.EmailEditingMethods.NormalText;
		EndDo;
		If AccountsSettings.Modified() Then
			AccountsSettings.Write();
		EndIf;
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		Raise;
		
	EndTry;
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
